/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   sys_exprs_strings.c                                :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: hgranule <marvin@42.fr>                    +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/10/18 19:52:37 by hgranule          #+#    #+#             */
/*   Updated: 2019/10/18 21:21:13 by hgranule         ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "sys_tools/sys_token_to_str.h"
#include "executer.h"

/*
** Здесь будут функции получения аргументов командной строки для процессов.
** Получение аргументов производится путем парсинга структур для
** исполняемой таблицы!
*/
