/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   bltn.h                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fnancy <fnancy@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/08/27 18:42:17 by fnancy            #+#    #+#             */
/*   Updated: 2019/08/27 20:12:15 by fnancy           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#ifndef BLTN_H
# define BLTN_H

# include "libft.h"
# include "ft_avl_tree.h"
# include "env.h"
# include "rms.h"

/* Добавляет новую глобальную переменную или изменяет уже существующую с ключом $key и значением $value. */
int	bltn_setenv(char *key, char *value, ENV *env);

/* Выводит в стандартный вывод значение всех глобальных переменных в формате ключ=значение. */
int	bltn_env(ENV *env);

/* Выводит в стандартный вывод значение глобальной переменной с ключом key*/
int	bltn_getenv(char *key, ENV *env);

/* Удаляет глобальную переменную.*/
int	bltn_unsetenv(char *key, ENV *env);
#endif